[
    {
        "id": 94,
        "code": "UGLA-LAPOSBA",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/20170224dronelecture_08.JPG",
        "title": "Political Science (BA)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "120",
        "totalClasses": "39",
        "shortDescription": "<p>The Bachelor of Arts in political science pairs the development of reasoning and critical thinking with a curriculum focused on policy, public issues and citizens’ interactions with government. You’ll learn about local, national and international political concerns while building valuable skills needed for a successful career in the field.</p>\n",
        "category": "Undergraduate",
        "interestAreas": [
            "Law, criminal justice and public service",
            "Social Sciences"
        ],
        "featuredCourses": {
            "title": "Online political science degree courses",
            "description": "<p>In addition to completing core courses, you’ll have the opportunity to focus on areas of individual interest through electives. Internships are another key component. As a student, you’ll learn to analyze policy, communicate effectively and engage in productive research. Examples of featured courses include:</p>\n",
            "items": [
                {
                    "category": null,
                    "title": "POS 210: Political Ideologies (SB)",
                    "description": "Leading political ideas and belief systems, e.g., Marxism, liberalism, conservatism, theories of democracy, and alternative futures."
                },
                {
                    "category": null,
                    "title": "POS 301: Empirical Political Inquiry (SB)",
                    "description": "Logic of political inquiry, including research problems, concepts, hypotheses, theories, measurement, data collection, and analysis. "
                },
                {
                    "category": null,
                    "title": "POS 150: Comparative Government (SB & G)",
                    "description": "Political institutions and processes in selected foreign countries, including origins, strengths, and weaknesses of contemporary political systems and political development."
                },
                {
                    "category": null,
                    "title": "POS 160: Global Politics (SB & G)",
                    "description": "Nature of contemporary world politics through the study of both general theoretical topics and specific geographical areas."
                },
                {
                    "category": null,
                    "title": "POS 110: American Government and Politics (SB)",
                    "description": "Major institutions of modern government and processes of individual and group political activity, with emphasis on the American experience. Meets the federal government requirement for teacher certification."
                }
            ]
        }
    },
    {
        "id": 95,
        "code": "UGLA-LAPOSBS",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/Frank-Smith-III-CONGRESS_0.jpg",
        "title": "Political Science (BS)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "120",
        "totalClasses": "40",
        "shortDescription": "<p>The Bachelor of Science in political science focuses on the relationship between citizens and their governments. As a student in this bachelor's in political science program, you’ll build an in-depth understanding of how political theory and policy connect to practical issues. During your studies, you’ll develop skills that are applicable in business, politics, government and nonprofit careers.</p>\n",
        "category": "Undergraduate",
        "interestAreas": [
            "Law, criminal justice and public service",
            "Social Sciences"
        ],
        "featuredCourses": {
            "title": "Online political science degree courses",
            "description": "<p>This political science degree offers a variety of courses and opportunities to study politics and public policy at the local, national and global levels. While completing your courses, you'll have the opportunity to complete an internship, allowing you to gain real-world experience. Featured courses include: </p>\n",
            "items": [
                {
                    "category": null,
                    "title": "POS 210: Political Ideologies (SB)",
                    "description": "Leading political ideas and belief systems, e.g., Marxism, liberalism, conservatism, theories of democracy, and alternative futures."
                },
                {
                    "category": null,
                    "title": "POS 301: Empirical Political Inquiry (SB)",
                    "description": "Logic of political inquiry, including research problems, concepts, hypotheses, theories, measurement, data collection, and analysis. "
                },
                {
                    "category": null,
                    "title": "POS 401: Political Statistics (CS)",
                    "description": "Basic concepts in statistics as they facilitate the description, explanation, and prediction of social and political phenomena. "
                },
                {
                    "category": null,
                    "title": "POS 150: Comparative Government (SB & G)",
                    "description": "Political institutions and processes in selected foreign countries, including origins, strengths, and weaknesses of contemporary political systems and political development."
                },
                {
                    "category": null,
                    "title": "POS 160: Global Politics (SB & G)",
                    "description": "Nature of contemporary world politics through the study of both general theoretical topics and specific geographical areas."
                },
                {
                    "category": null,
                    "title": "POS 110: American Government and Politics (SB)",
                    "description": "Major institutions of modern government and processes of individual and group political activity, with emphasis on the American experience. Meets the federal government requirement for teacher certification."
                }
            ]
        }
    },
    {
        "id": 1446,
        "code": "UGLA-LASGSBA",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/GlobalStudies_DegreeImage.jpg",
        "title": "Global Studies (BA)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "120",
        "totalClasses": "39",
        "shortDescription": "<p>In an increasingly globalized society, it’s crucial that today’s leaders understand the impact of economics, the environment, culture, governance, human rights and religion throughout the world. Arizona State University’s Bachelor of Arts in global studies incorporates insights from multiple disciplines to support your growth as a student and a professional with an international focus.</p>\n",
        "category": "Undergraduate",
        "interestAreas": [
            "Law, criminal justice and public service",
            "Social Sciences"
        ],
        "featuredCourses": {
            "title": "Featured global studies courses",
            "description": "<p>Courses in the global studies major draw from a broad array of perspectives. Coursework covers topics like statistics, political inquiry, cultural understanding, global justice and more. In the capstone, you’ll have the chance to complete an internship abroad. You may also take part in a different global experience. Courses in the major include:</p>\n",
            "items": [
                {
                    "category": null,
                    "title": "SGS 101: Thinking Globally (SB & G)",
                    "description": "Survey of globalization processes in historical context, including economic, political, cultural and technological dynamics, and human efforts to analyze and address contemporary global issues. Provides a grounding in patterns of global social change and diverse theoretical approaches to understanding them. Topics addressed vary and may include the emergence and dynamics of capitalism, trade, labor, economic inequality and development; the interstate system, democracy, nationalism, colonialism and post-colonialism; global governance, social movements and resistance to globalization; immigration, environmental and health challenges; media, art and identities including race, ethnicity, language and religion."
                },
                {
                    "category": null,
                    "title": "SGS 204: Professional Global Career Development",
                    "description": "Orients the student to working in global contexts and to thinking critically about careers in the global arena. Focuses on working in organizational settings distinctly global. Three modules: nation-state, corporations, and working international organizations."
                },
                {
                    "category": null,
                    "title": "SGS 484: Internship ",
                    "description": "Structured practical experience following a contract or plan, supervised by faculty and practitioners."
                },
                {
                    "category": null,
                    "title": "SGS 484: Global Experience ",
                    "description": "Structured practical experience following a contract or plan, supervised by faculty and practitioners."
                }
            ]
        }
    },
    {
        "id": 1453,
        "code": "GRLA-LAGSCMA",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/220120-ASU-Thrive-PBC-4-JR-%281%29.jpg",
        "title": "Global Security (MA)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "30",
        "totalClasses": "10",
        "shortDescription": "<p>The Master of Arts in global security is an interdisciplinary and thought-provoking program, linking serious ideas with practical case studies. In this security studies master’s program, you’ll be trained to critically engage global conflict and international security in a comprehensive manner.</p>\n",
        "category": "Graduate",
        "interestAreas": [
            "Law, criminal justice and public service",
            "Social Sciences"
        ],
        "featuredCourses": {
            "title": "Global security courses",
            "description": "<p>This security studies master’s degree is made up of one core course, electives and a capstone. Topics you’ll study range from U.S. politics of security and security studies to emerging technologies in security and global trends. Courses may include:</p>\n",
            "items": [
                {
                    "category": "Core",
                    "title": "War, Conflict and Security",
                    "description": "In this course, you’ll analyze interdisciplinary approaches to conflict and international security with a focus on defining a strategic approach to short, medium and long-term global trends. You’ll also review key philosophical and social science theories of war and conflict drawn from international relations, sociology and conflict studies."
                },
                {
                    "category": "Elective",
                    "title": "Security Studies",
                    "description": "In this course, you’ll consider key determinants of global insecurity, including ungoverned spaces, civilizational conflict, technological innovation, climate change and terrorism. This course provides a background in links between security, economic well-being and principles of domestic and international governance."
                },
                {
                    "category": "Elective",
                    "title": "Future of War",
                    "description": "In this course, you’ll learn about the profound social, political, economic and cultural implications of the changing nature of war and conflict. You’ll also gain an overview of some classic philosophical and military-strategic theories and conceptions of war, the complex threats of groups operating beyond and across state boundaries and the danger of the democratization of terror and mechanisms of mass destruction."
                },
                {
                    "category": "Elective",
                    "title": "Understanding Conflict and War",
                    "description": "In this course, you’ll discuss the different definitions and meanings of war and armed conflict. You’ll also analyze key theories used to understand conflict, including realism, neorealism, liberalism and constructivism."
                },
                {
                    "category": "Elective",
                    "title": "Law of War",
                    "description": "In this course, you’ll gain an overview of key elements of the law of war, also known as international humanitarian law and the law of armed conflict. You’ll engage basic questions of international law, reviewing its history, sources and structure. This course also covers jus ad bellum, the rules governing how states legally go to war as well as jus in bello and the established ideas regarding how to manage actions during armed conflict."
                },
                {
                    "category": "Elective",
                    "title": "U.S. Politics of Security",
                    "description": "In this course, you’ll learn about the structure of U.S. national security institutions and the ways in which they both work together and often operate in conflict. You’ll also review separation of powers issues as linked to war and policy, as well as engaging the structure and function of multiple institutions."
                },
                {
                    "category": "Elective",
                    "title": "Global Politics of Security",
                    "description": "In this course, you’ll review the structure of international security institutions and actors, including non-governmental organizations, the United Nations’ Security Council, peacekeeping missions, regional organizations (NATO, EU, Inter-American System, ASEAN, etc.) and others. You’ll also consider the roles of private military and intelligence contractors and corporations working on issues of direct and indirect relation to security issues."
                },
                {
                    "category": "Elective",
                    "title": "Comparative Studies of Conflict",
                    "description": "In this course, you’ll gain a critical overview of key theories on the causes, justifications and structures of armed political conflict. This course begins by outlining core issues within the problem of social order, that is, how to think about managing governance and power. You’ll then review the idea of “collective action” and its link with force and violence, ideas that are contrasted with nonviolence as a political strategy."
                },
                {
                    "category": "Elective",
                    "title": "Emerging Technologies and Global Security",
                    "description": "In this course, you’ll review the impact and significance of emerging technologies and global security with a focus on cybersecurity/cyberwar, mass surveillance, autonomous systems, drones, bio- and genetic weapons and weapons of mass destruction. This course considers past, current and future technologies in terms of general strategic theories and projected impacts on global security."
                },
                {
                    "category": "Elective",
                    "title": "Governance in Post-Conflict/Transitional Contexts",
                    "description": "In this course, you’ll consider the challenges of governance in post-conflict and transitional contexts. This includes issues of peacekeeping, stability operations, reconstruction and governance. It also includes strategies and mechanisms of transitional justice to address past atrocities including trials, truth commissions, vetting, reparations and institutional reform."
                },
                {
                    "category": "Elective",
                    "title": "Terrorism and Insurgency",
                    "description": "In this course, you’ll learn about the use of terror by governments, insurgents and other non-state actors. You’ll also review key theories as to the causes, meaning and impact of the deployment of terror as a strategy by distinct groups. This involves a consideration of state terror, insurgencies and global terror networks."
                },
                {
                    "category": "Elective",
                    "title": "Global Trends",
                    "description": "In this course, you’ll take a broad look at emerging global patterns as they relate to governance, security and social order. You’ll also examine a number of interrelated topics, including globalization and various forms of backlash, populist movements, socioeconomic inequality both within and between societies, the shifting of economic power from the global west to the global east, and more."
                },
                {
                    "category": "Elective",
                    "title": "Security & the Global Economy",
                    "description": "<p>In this course, you’ll focus on how contemporary international relations — especially great power competition — is conducted primarily through economic means. You’ll also explore the link between global stability, national security and economics in the context of competition between the world’s predominant power and its rising one, as well as how this is changing the global order. No prior knowledge of economics is required.</p>\n"
                },
                {
                    "category": "Culminating experience",
                    "title": "Capstone",
                    "description": "This course serves as the culminating experience of the global security program. In it, you’ll explore a research area, interest, theme or question. Your final project will be developed individually based on consultation with faculty."
                }
            ]
        }
    },
    {
        "id": 1938,
        "code": "GRLA-LAGSCSECMA",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/Human-Systems-Engineering-1-%281%29.jpg",
        "title": "Global Security – Cybersecurity (MA)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "30",
        "totalClasses": "10",
        "shortDescription": "<p>In the Master of Arts in global security with a concentration in cybersecurity program, you’ll learn about important challenges facing the diplomatic, intelligence and military communities. By focusing on international cybersecurity, you can better understand the growing threat landscape faced by countries around the world.</p>\n",
        "category": "Graduate",
        "interestAreas": [
            "Law, criminal justice and public service",
            "Social Sciences",
            "Social Sciences",
            "STEM",
            "Computer science and technology"
        ],
        "featuredCourses": {
            "title": "Cybersecurity classes",
            "description": "<p>This cybersecurity degree concentration is designed to fit your schedule. You can complete courses from anywhere at your own pace while working or raising a family. The program culminates in a capstone project, such as a research paper, group project or policy memo.</p>\n\n<p>Throughout the curriculum, topics and course content may be informed by current events, with inspiration provided by the annual Global Security Forum, the CFW Spring Speaker Series and events hosted by the International Security Program from New America. Available classes are regularly expanding. Options currently include:</p>\n",
            "items": [
                {
                    "category": "Core",
                    "title": "Overview of Cybersecurity",
                    "description": "<p>This course provides an overview of key issues and ideas associated with cybersecurity. Course topics include the principles of cybersecurity and the special challenges posed by an interconnected world; key elements of internet architecture; outline of cyberattacks and cyberdefense; public and private internet governance and protection; espionage; and an overview of cyberwar. Students learn core concepts regarding the cyber domain, the nature and structure of the internet and how to understand the special risks, benefits, offensive and defensive elements of an increasingly interconnected world.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Cybersecurity Threats and Trends",
                    "description": "<p>This course provides an overview of cybersecurity threats and trends. Course topics include an overview of hacking and data breaches; special challenges and risks associated with protecting critical infrastructure on a state and federal level; and the complex, global threats posed by cybercrime. Students explore the risks associated with rapidly expanding social media and interconnectedness currently and into the future. Students also learn about key legal and ethical issues associated with cybersecurity policy.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Cybersecurity Global Politics and Resiliency",
                    "description": "<p>This course provides an introduction and policy overview of cybersecurity preparation and resiliency. Because cybersecurity threats change so rapidly and because complete protection for most systems is impossible in an interconnected world, a significant amount of cyber policy focuses on improving mechanisms of preparation and enabling multiple forms of resiliency. The general idea is that attacks cannot be prevented or fully anticipated so creating more flexible, redundant and multi-faceted systems is a useful cybersecurity policy.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Cybersecurity Planning and Strategy ",
                    "description": "<p>This course provides an introduction and policy overview of cybersecurity planning and strategy. Since cybersecurity is a constantly evolving field, many aspects of planning are in a state of continual evolution. For this reason, many believe that broad-based, though flexible, strategies are necessary to enable key actors and institution to engage in adequate preparatory policies and to ensure general cybersecurity preparedness.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Security Studies",
                    "description": "<p>This course continues the exploration of the rapidly changing and highly complex geopolitical, technological and strategic context within which modern conflict and war occur, including the profound social, political, economic and cultural implications of the changing nature of war and conflict. It provides an overview of several fundamental themes that run through the history of war and strategy, and discusses the increasing importance of nonmilitary 'soft power' in managing conflict situations. The course also introduces the importance of regional knowledge in conflict as a critical operational competence (using the Russian invasion of Crimea and Ukraine as a case study), as well as the broader challenges of civilizational conflict and the importance of identity and narrative in modern conflict.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Future of War",
                    "description": "<p>This course provides an overview of key issues, themes and ideas associated with the future of war. It contextualizes this discussion with a reflection on the impact of 9/11, especially within the U.S. The course engages a number of core concepts, including the meaning, nature and experience of war including theories that violence is in decline. It also considers the changing impact of new wars on civilians, shifts in current and future technology and future scenarios including questions of climate change, global demographics and potential major power conflicts. This course links the ideas, theories and understandings of the future of war with specific cases and concrete examples.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Understanding Conflict and War",
                    "description": "<p>This course provides a critical overview of different definitions and meanings of war and armed conflict. It engages key theories used to understand conflict including realism, neorealism, liberalism and constructivism. The course considers core issues in the field, linking empirical studies with explanations for what drives, sustains and resolves conflict including reviewing the fact that democratic states tend not to go to war with each other (the democratic peace); the structure and logic of arms races; escalation and alliance; and core ideas regarding peace, conflict management and conflict resolution. Many of the issues and theories reviewed in this class are linked with case studies and concrete examples.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Law of War",
                    "description": "<p>This course provides an overview of key elements of the law of war, also known as international humanitarian law (IHL) and the law of armed conflict (LOAC). It engages basic questions of international law, reviewing its history, sources and structure. The course covers jus ad Bellum, the rules governing how states legally go to war as well as jus in bello, the established ideas regarding how to manage actions during armed conflict. It also covers key principles within the law of war, including distinction, proportionality and necessity as well as reviewing the differences between international and noninternational armed conflicts and other key ideas. You’ll review the systems through which the law of war is enforced and also considers basic theoretical and practical issues regarding compliance. In general, links the ideas, practices, rules and understandings of the law of war with specific cases and concrete examples.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "U.S. Politics of Security",
                    "description": "<p>This course builds a foundational understanding of the complex sy of formal and informal actors and structural forces that shape U.S. security policy. It starts with both theoretical and case study examinations of the role domestic politics plays in the production of policy decisions. It analyzes critical institutional actors and relationships between actors, including: the President and Congress, the National Security Council and interagency, and the civilian-military relationship. Finally, it investigates key structural forces placed on the policy-making process by the American society, and the relationship between policymakers and the public.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Global Politics of Security",
                    "description": "<p>This course offers several approaches to understanding the global politics of security, including: the structure of international and multinational security institutions and actors including nongovernmental organizations (NGOs), the United Nations' Security Council, peacekeeping missions, regional organizations (NATO, EU, Inter-American System, ASEAN) and others. It also considers the roles of private military and intelligence contractors and corporations working on issues of direct and indirect relation to security issues. Through specific case studies and examples, you’ll review the operation of these bodies and their complex relationships.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Comparative Studies of Conflict",
                    "description": "<p>This course provides a critical overview of key theories on the causes, justifications and structures of political conflict and the use of violence. The course begins by outlining core issues within the problem of social order, that is, how to think about managing governance and power. It reviews the idea of 'collective action' and its link with force and violence, ideas that are contrasted with nonviolence as a political strategy. Then it considers civil wars and interstate wars, comparing these forms of organized violence, as well as the current challenges of armed nonstate actors (within an international system premised on states) and an overview of the meaning of peace. The course links the issues and theories reviewed in this class with case studies and concrete examples as a means of linking key ideas with their practical and policy implications.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Emerging Technologies and Global Security",
                    "description": "<p>This course provides an introduction to the implications of accelerating changes in military and security technologies, fueled by rapid developments in five core technology systems: nanotechnology, biotechnology, information and communications technology (ICT), robotics and applied cognitive science. The course also introduces the idea of revolutions in military affairs, a concept that has been used to frame discussions about the strategic implications of new technologies from drones to cyber.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Governance in Post-Conflict/Transitional Contexts",
                    "description": "<p>One of the most pressing current global security policy issues involves understanding and implementing strategies, mechanisms and processes to address post-conflict and transitional contexts. How do societies create and manage representational governance after the fall of authoritarian regimes? How can institutions be rebuilt and reconstituted? How can a social order address the justice demands of victims of brutal political violence whose suffering was often a key element of prior systems of rule? This course provides a critical introduction to the field of post-conflict reconstruction and transitional justice. It reviews the tense and uncertain nature of post-conflict environments and their challenges, engages the security questions raised by peacekeeping and stability operations. The course also considers the difficulties of governance and reconstruction in the aftermath of conflict.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Terrorism and Insurgency",
                    "description": "<p>This course provides a critical overview of the use of terror by governments, insurgents and other nonstate actors. It engages the definition of terrorism and provides an overview of key practices and strategies. You’ll review key theories as to the causes, meaning and impact of the deployment of terror as a strategy by distinct groups. This involves a consideration of state terror, insurgencies and global terror networks. You’ll also link many of the core ideas reviewed in this class with a set of case studies designed to ground the broader discussion of terror within specific situations and contexts.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Global Trends",
                    "description": "<p>This course provides an overview of a number of key issues within global politics in the post-Second World War era. It reviews important institutions, including the United Nations, the World Bank and the International Monetary Fund. The course provides a critical review of key theories, discourses and practices of international development, decolonization, democratization, poverty and gender issues. You’ll review these major aspects of global society in relationship to core questions of governance and social order with a consideration of past, present and future trends.</p>\n"
                }
            ]
        }
    },
    {
        "id": 2022,
        "code": "GRLA-LAPPSMA",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/20190313PolicyDesignStudio_032.JPG",
        "title": "Political Psychology (MA)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "30",
        "totalClasses": "10",
        "shortDescription": "<p>The Master of Arts in political psychology explores the cognitive forces that influence political decision-making. In this program, you’ll examine voter behavior and learn how to apply this knowledge to political campaigns and communications.</p>\n",
        "category": "Graduate",
        "interestAreas": [
            "Law, criminal justice and public service",
            "Leadership and management"
        ],
        "featuredCourses": {
            "title": "Psychology and politics courses",
            "description": "<p>In this political psychology master’s program, you’ll take courses that’ll help you understand the minds of voters and citizens. You’ll explore the forces that impact voters’ political decision-making and learn many of the skills you need to understand and influence these decisions.</p>\n",
            "items": [
                {
                    "category": "Core",
                    "title": "Attitudes and Persuasion",
                    "description": "<p>In this course, you’ll focus on the factors responsible for changes in beliefs, attitudes and behaviors. First covered in the course are the concept of attitudes and their measurement. Then, various theoretical approaches that explain how people come to change their attitudes. The course ends with an application-focused look at persuasion. Coursework also covers how to craft persuasive political messaging.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Biopolitics",
                    "description": "<p>In this course, you’ll build a foundational understanding of biological, evolutionary, genetic and neurobiological perspectives in political psychology. These perspectives are combined to explain political attitudes and behavior. You will read related literature on developmental psychology, neurobiology, genetics and more.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Cognition and Emotions in Political Thinking",
                    "description": "<p>In this course, you’ll focus on key concepts in cognitive psychology and the scientific study of mental processes. Topics include perception, attention, language, memory, reasoning, problem-solving, decision-making and attributions. The relation between emotions and cognition are also covered.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Experimental Design",
                    "description": "<p>In this course, you’ll study the experimental paradigm that permeates political psychology research. You will master the logic of experimentation and learn how to design and evaluate experimental studies. The course is focused on the benefits and drawbacks of a variety of different experimental designs.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Fundamentals of Political Psychology",
                    "description": "<p>In this course, you’ll learn the tools necessary to apply political psychology theories to marketing, political campaigns and policy advocacy. The course examines topics including personality, emotions and genetic bases of behavior. It also covers approaches to the design and interpretation of experimental research.</p>\n"
                },
                {
                    "category": "Core",
                    "title": "Prejudice, Stereotypes and Intergroup Relations",
                    "description": "<p>In this course, you’ll explore why stereotypes and prejudice exist and their implications for politics. Students in the course are also introduced to Social Identity Theory and its application to politics. You will learn the theoretical arguments for and concrete examples of how prejudice can be reduced and tolerance increased.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Advances in Media Effects",
                    "description": "<p>This course provides an advanced examination of contemporary research and debates on media effects. You will examine the underlying psychological mechanisms through which the media can affect citizens’ attitudes and judgments. In the course, a variety of examples are used to demonstrate both the power and limits of the media.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Campaigns and Elections",
                    "description": "<p>This course covers the effect of election rules, campaigns, social networks and the media on turnout and voter choices. Students engage with research that addresses these topics through psychological lenses focusing on the role of emotions, negativity, persuasion and learning. Implications for campaign organization and management are also discussed.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Elite Decision Making",
                    "description": "<p>In this course, you’ll learn about political psychology approaches to understanding and evaluating elite decision-making. The course is focused on frameworks that will help you systematically study how elite actors make decisions on the domestic and international stage.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Political Polarization",
                    "description": "<p>This course includes an overview of recent trends in political polarization in the U.S. Debates such as whether polarization has increased over time and whether Americans are polarized around issues or social identities are also covered. In the course, you will also explore how the media and other external factors can affect citizens in ways that can either fuel or weaken the intensity of polarization.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Public Opinion",
                    "description": "<p>In this course, you’ll learn about how citizens structure their opinions and what factors can cause these opinions to change. In the course, various theoretical perspectives and methodological approaches used to study public opinion are also evaluated. The course also provides insight into how these factors shape people’s evaluation of government and how individual-level opinions are aggregated to produce public opinion.</p>\n"
                },
                {
                    "category": "Culminating experience",
                    "title": "Capstone",
                    "description": "<p>This course serves as the required culminating experience of the degree. You will apply the theories, frameworks and evidence encountered during the course to explore a novel question or contribute to a contemporary research debate. In the process, you will apply a multitude of tools you acquired during the program.</p>\n"
                }
            ]
        }
    },
    {
        "id": 2233,
        "code": "GRLA-LAIALMA",
        "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/International%20Affairs%20Hero%201.jpg",
        "title": "International Affairs and Leadership (MA)",
        "weeksPerClass": "7.5",
        "nextStartDate": "2024-01-08",
        "totalCreditHours": "30",
        "totalClasses": "10",
        "shortDescription": "<p>The online master’s in international affairs and leadership is ideal for individuals who are passionate about global issues and who want to make a positive impact on the world. You’ll prepare to become a leader in the international affairs realm.</p>\n",
        "category": "Graduate",
        "interestAreas": [
            "Behavioral sciences",
            "Law, criminal justice and public service",
            "Social Sciences"
        ],
        "featuredCourses": {
            "title": "International affairs and leadership courses",
            "description": "<p>This program is not cohort-based, which means you can choose to take one or more courses as your schedule permits. You’ll complete unique courses to develop your vision and skills as a character-driven leader in your career and community. Courses focus on international themes for the future and regional issues in key global areas. Electives are taught by former ambassadors and policy managers with deep practical experience in both strategic diplomacy and grass roots engagement in a variety of cultures.</p>\n",
            "items": [
                {
                    "category": "Required",
                    "title": "Principles of Character-Driven Leadership",
                    "description": "<p>This course covers the core concepts of character-driven leadership defined as the commitment to do the right thing, the right way for the right reasons. The course focuses on values – individual, organizational and national – along with ethics, culminating with a clear understanding of leadership.</p>\n"
                },
                {
                    "category": "Required",
                    "title": "The Making of U.S. National Security Policy",
                    "description": "<p>This course outlines the origins and current structure of America’s national security architecture. Using actual policy decisions, students will exercise the process of analysis, decision-making and translating into action elements of the country’s national security agenda. The course will also include intensive analysis of the intent and outcome of such critical policy decisions and the leadership exercised by the participating decision-makers.</p>\n"
                },
                {
                    "category": "Required",
                    "title": "Applied International Leadership: Case Studies",
                    "description": "<p>In this course, students will engage with faculty and with each other in multiple in-depth applied leadership scenarios, examining various aspects of leadership in international settings. The semester will culminate in individual student presentations analyzing a complex international leadership challenge.</p>\n"
                },
                {
                    "category": "Required",
                    "title": "Capstone",
                    "description": "<p>Each student must prepare a comprehensive presentation capturing the knowledge and insights gained during the degree program, focused on a specific international affairs leadership challenge. A 45-minute oral and written presentation must show analytical rigor and defend a tangible strategic plan for achieving impact and positive change.</p>\n"
                },
                {
                    "category": "Elective ",
                    "title": "U.S. Diplomacy in Action – the Embassy Country Team",
                    "description": "<p>Led by a former U.S. Ambassador, students constitute an U.S. Embassy Country Team for a specific country and manage a reality-based diplomatic agenda. Students will be assigned the actual roles of Embassy team members, and together with their “Ambassador” will practice how U.S. foreign policy is developed and executed in the field.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "The Modern Global Economy: Dollars and Sense",
                    "description": "<p>Students will be challenged to consider future economic and business trends and technology that offer growth and opportunities, but also economic and business developments that threaten stability such as cyber threats and pandemics. Traditional trading and finance global systems will be compared to the rising new economic “nationalism\". Regional economic alliances will be evaluated.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Transatlantic Relations: Does Europe Still Matter?",
                    "description": "<p>This course projects forward the directions the U.S. and Europe are moving. The students will be challenged to analyze and consider “over the horizon” trends and opportunities, but also the risks of conflict and how to mitigate and solve challenges. Case studies will present “Character-driven leadership” by U.S. and European leaders as they manage issues of cooperation and competition.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Western Hemisphere: Good Neighbors, Tough Challenges",
                    "description": "<p>This course will explore the opportunities and challenges facing the United States in its relationships with its regional neighbors, including Canada, Mexico, Central America, the Caribbean and South America. The lectures and readings will consider how the region’s social, cultural and economic history shapes its relations with the U.S. and the rest of the world.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Human Rights and Realpolitik",
                    "description": "<p>This course will explore the origins of the human rights movement, watershed moments and contemplate what may be next. The course is based on the foundation that respecting human rights is not simply the right moral choice, but one that has economic and national security implications: that the world is more prosperous and more secure when freedom and rights are universally afforded.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Setting a Global Counterterrorism Agenda",
                    "description": "<p>Students analyze, discuss and propose tactics and strategies for countering global terrorism, mainly, but not exclusively from the U.S. perspective. This course focuses on U.S. counter-terrorism strategy against Middle East terrorism since 9/11. Based on actual policy decisions, students will exercise the process of decision-making and translating into action, elements of the U.S. counter-terrorism agenda in partnership with allies and adversaries.</p>\n"
                },
                {
                    "category": "Elective",
                    "title": "Transnational Challenges – Combatting Human Trafficking",
                    "description": "<p>This course gives a practical, global, interdisciplinary examination of the many issues surrounding human trafficking and modern slavery. Students will connect similarities and differences between historical and modern-day slavery, analyze the role and impact of criminal and civil justice sector decisions and actions in fighting human trafficking and understand the role of international and national laws and other government rulemaking.</p>\n"
                },
                {
                    "category": null,
                    "title": "Special Topic Courses",
                    "description": "<p>These are new courses that are developed by ASU Professors of Practice and other ASU faculty who serve the educational outcomes of the program but have not yet been turned into permanent courses.</p>\n"
                },
                {
                    "category": null,
                    "title": "Elective Internship",
                    "description": "<p>As an addendum to the 30 credit hour MA program , students can voluntarily identify and participate in a semester-long field project in the public or private sector in an international setting, either abroad or with a U.S.-based international organization. As part of the internship, the student must integrate into the assigned organization’s professional team and participate in its mission achievement. International affairs and leadership faculty and staff will be available to advise on internship opportunities.</p>\n"
                }
            ]
        }
    }
]
