{
    "id": 1446,
    "code": "UGLA-LASGSBA",
    "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/GlobalStudies_DegreeImage.jpg",
    "title": "Global Studies (BA)",
    "weeksPerClass": "7.5",
    "nextStartDate": "2024-01-08",
    "totalCreditHours": "120",
    "totalClasses": "39",
    "shortDescription": "<p>In an increasingly globalized society, it’s crucial that today’s leaders understand the impact of economics, the environment, culture, governance, human rights and religion throughout the world. Arizona State University’s Bachelor of Arts in global studies incorporates insights from multiple disciplines to support your growth as a student and a professional with an international focus.</p>\n",
    "category": "Undergraduate",
    "interestareas": [
        "Law, criminal justice and public service",
        "Social Sciences"
    ],
    "featuredCourses": {
        "title": "Featured global studies courses",
        "description": "<p>Courses in the global studies major draw from a broad array of perspectives. Coursework covers topics like statistics, political inquiry, cultural understanding, global justice and more. In the capstone, you’ll have the chance to complete an internship abroad. You may also take part in a different global experience. Courses in the major include:</p>\n",
        "items": [
            {
                "category": null,
                "title": "SGS 101: Thinking Globally (SB & G)",
                "description": "Survey of globalization processes in historical context, including economic, political, cultural and technological dynamics, and human efforts to analyze and address contemporary global issues. Provides a grounding in patterns of global social change and diverse theoretical approaches to understanding them. Topics addressed vary and may include the emergence and dynamics of capitalism, trade, labor, economic inequality and development; the interstate system, democracy, nationalism, colonialism and post-colonialism; global governance, social movements and resistance to globalization; immigration, environmental and health challenges; media, art and identities including race, ethnicity, language and religion."
            },
            {
                "category": null,
                "title": "SGS 204: Professional Global Career Development",
                "description": "Orients the student to working in global contexts and to thinking critically about careers in the global arena. Focuses on working in organizational settings distinctly global. Three modules: nation-state, corporations, and working international organizations."
            },
            {
                "category": null,
                "title": "SGS 484: Internship ",
                "description": "Structured practical experience following a contract or plan, supervised by faculty and practitioners."
            },
            {
                "category": null,
                "title": "SGS 484: Global Experience ",
                "description": "Structured practical experience following a contract or plan, supervised by faculty and practitioners."
            }
        ]
    }
}
