{
    "id": 1453,
    "code": "GRLA-LAGSCMA",
    "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/220120-ASU-Thrive-PBC-4-JR-%281%29.jpg",
    "title": "Global Security (MA)",
    "weeksPerClass": "7.5",
    "nextStartDate": "2024-01-08",
    "totalCreditHours": "30",
    "totalClasses": "10",
    "shortDescription": "<p>The Master of Arts in global security is an interdisciplinary and thought-provoking program, linking serious ideas with practical case studies. In this security studies master’s program, you’ll be trained to critically engage global conflict and international security in a comprehensive manner.</p>\n",
    "category": "Graduate",
    "interestareas": [
        "Law, criminal justice and public service",
        "Social Sciences"
    ],
    "featuredCourses": {
        "title": "Global security courses",
        "description": "<p>This security studies master’s degree is made up of one core course, electives and a capstone. Topics you’ll study range from U.S. politics of security and security studies to emerging technologies in security and global trends. Courses may include:</p>\n",
        "items": [
            {
                "category": "Core",
                "title": "War, Conflict and Security",
                "description": "In this course, you’ll analyze interdisciplinary approaches to conflict and international security with a focus on defining a strategic approach to short, medium and long-term global trends. You’ll also review key philosophical and social science theories of war and conflict drawn from international relations, sociology and conflict studies."
            },
            {
                "category": "Elective",
                "title": "Security Studies",
                "description": "In this course, you’ll consider key determinants of global insecurity, including ungoverned spaces, civilizational conflict, technological innovation, climate change and terrorism. This course provides a background in links between security, economic well-being and principles of domestic and international governance."
            },
            {
                "category": "Elective",
                "title": "Future of War",
                "description": "In this course, you’ll learn about the profound social, political, economic and cultural implications of the changing nature of war and conflict. You’ll also gain an overview of some classic philosophical and military-strategic theories and conceptions of war, the complex threats of groups operating beyond and across state boundaries and the danger of the democratization of terror and mechanisms of mass destruction."
            },
            {
                "category": "Elective",
                "title": "Understanding Conflict and War",
                "description": "In this course, you’ll discuss the different definitions and meanings of war and armed conflict. You’ll also analyze key theories used to understand conflict, including realism, neorealism, liberalism and constructivism."
            },
            {
                "category": "Elective",
                "title": "Law of War",
                "description": "In this course, you’ll gain an overview of key elements of the law of war, also known as international humanitarian law and the law of armed conflict. You’ll engage basic questions of international law, reviewing its history, sources and structure. This course also covers jus ad bellum, the rules governing how states legally go to war as well as jus in bello and the established ideas regarding how to manage actions during armed conflict."
            },
            {
                "category": "Elective",
                "title": "U.S. Politics of Security",
                "description": "In this course, you’ll learn about the structure of U.S. national security institutions and the ways in which they both work together and often operate in conflict. You’ll also review separation of powers issues as linked to war and policy, as well as engaging the structure and function of multiple institutions."
            },
            {
                "category": "Elective",
                "title": "Global Politics of Security",
                "description": "In this course, you’ll review the structure of international security institutions and actors, including non-governmental organizations, the United Nations’ Security Council, peacekeeping missions, regional organizations (NATO, EU, Inter-American System, ASEAN, etc.) and others. You’ll also consider the roles of private military and intelligence contractors and corporations working on issues of direct and indirect relation to security issues."
            },
            {
                "category": "Elective",
                "title": "Comparative Studies of Conflict",
                "description": "In this course, you’ll gain a critical overview of key theories on the causes, justifications and structures of armed political conflict. This course begins by outlining core issues within the problem of social order, that is, how to think about managing governance and power. You’ll then review the idea of “collective action” and its link with force and violence, ideas that are contrasted with nonviolence as a political strategy."
            },
            {
                "category": "Elective",
                "title": "Emerging Technologies and Global Security",
                "description": "In this course, you’ll review the impact and significance of emerging technologies and global security with a focus on cybersecurity/cyberwar, mass surveillance, autonomous systems, drones, bio- and genetic weapons and weapons of mass destruction. This course considers past, current and future technologies in terms of general strategic theories and projected impacts on global security."
            },
            {
                "category": "Elective",
                "title": "Governance in Post-Conflict/Transitional Contexts",
                "description": "In this course, you’ll consider the challenges of governance in post-conflict and transitional contexts. This includes issues of peacekeeping, stability operations, reconstruction and governance. It also includes strategies and mechanisms of transitional justice to address past atrocities including trials, truth commissions, vetting, reparations and institutional reform."
            },
            {
                "category": "Elective",
                "title": "Terrorism and Insurgency",
                "description": "In this course, you’ll learn about the use of terror by governments, insurgents and other non-state actors. You’ll also review key theories as to the causes, meaning and impact of the deployment of terror as a strategy by distinct groups. This involves a consideration of state terror, insurgencies and global terror networks."
            },
            {
                "category": "Elective",
                "title": "Global Trends",
                "description": "In this course, you’ll take a broad look at emerging global patterns as they relate to governance, security and social order. You’ll also examine a number of interrelated topics, including globalization and various forms of backlash, populist movements, socioeconomic inequality both within and between societies, the shifting of economic power from the global west to the global east, and more."
            },
            {
                "category": "Elective",
                "title": "Security & the Global Economy",
                "description": "<p>In this course, you’ll focus on how contemporary international relations — especially great power competition — is conducted primarily through economic means. You’ll also explore the link between global stability, national security and economics in the context of competition between the world’s predominant power and its rising one, as well as how this is changing the global order. No prior knowledge of economics is required.</p>\n"
            },
            {
                "category": "Culminating experience",
                "title": "Capstone",
                "description": "This course serves as the culminating experience of the global security program. In it, you’ll explore a research area, interest, theme or question. Your final project will be developed individually based on consultation with faculty."
            }
        ]
    }
}