{
    "id": 1938,
    "code": "GRLA-LAGSCSECMA",
    "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/Human-Systems-Engineering-1-%281%29.jpg",
    "title": "Global Security – Cybersecurity (MA)",
    "weeksPerClass": "7.5",
    "nextStartDate": "2024-01-08",
    "totalCreditHours": "30",
    "totalClasses": "10",
    "shortDescription": "<p>In the Master of Arts in global security with a concentration in cybersecurity program, you’ll learn about important challenges facing the diplomatic, intelligence and military communities. By focusing on international cybersecurity, you can better understand the growing threat landscape faced by countries around the world.</p>\n",
    "category": "Graduate",
    "interestareas": [
        "Law, criminal justice and public service",
        "Social Sciences",
        "Social Sciences",
        "STEM",
        "Computer science and technology"
    ],
    "featuredCourses": {
        "title": "Cybersecurity classes",
        "description": "<p>This cybersecurity degree concentration is designed to fit your schedule. You can complete courses from anywhere at your own pace while working or raising a family. The program culminates in a capstone project, such as a research paper, group project or policy memo.</p>\n\n<p>Throughout the curriculum, topics and course content may be informed by current events, with inspiration provided by the annual Global Security Forum, the CFW Spring Speaker Series and events hosted by the International Security Program from New America. Available classes are regularly expanding. Options currently include:</p>\n",
        "items": [
            {
                "category": "Core",
                "title": "Overview of Cybersecurity",
                "description": "<p>This course provides an overview of key issues and ideas associated with cybersecurity. Course topics include the principles of cybersecurity and the special challenges posed by an interconnected world; key elements of internet architecture; outline of cyberattacks and cyberdefense; public and private internet governance and protection; espionage; and an overview of cyberwar. Students learn core concepts regarding the cyber domain, the nature and structure of the internet and how to understand the special risks, benefits, offensive and defensive elements of an increasingly interconnected world.</p>\n"
            },
            {
                "category": "Core",
                "title": "Cybersecurity Threats and Trends",
                "description": "<p>This course provides an overview of cybersecurity threats and trends. Course topics include an overview of hacking and data breaches; special challenges and risks associated with protecting critical infrastructure on a state and federal level; and the complex, global threats posed by cybercrime. Students explore the risks associated with rapidly expanding social media and interconnectedness currently and into the future. Students also learn about key legal and ethical issues associated with cybersecurity policy.</p>\n"
            },
            {
                "category": "Core",
                "title": "Cybersecurity Global Politics and Resiliency",
                "description": "<p>This course provides an introduction and policy overview of cybersecurity preparation and resiliency. Because cybersecurity threats change so rapidly and because complete protection for most systems is impossible in an interconnected world, a significant amount of cyber policy focuses on improving mechanisms of preparation and enabling multiple forms of resiliency. The general idea is that attacks cannot be prevented or fully anticipated so creating more flexible, redundant and multi-faceted systems is a useful cybersecurity policy.</p>\n"
            },
            {
                "category": "Core",
                "title": "Cybersecurity Planning and Strategy ",
                "description": "<p>This course provides an introduction and policy overview of cybersecurity planning and strategy. Since cybersecurity is a constantly evolving field, many aspects of planning are in a state of continual evolution. For this reason, many believe that broad-based, though flexible, strategies are necessary to enable key actors and institution to engage in adequate preparatory policies and to ensure general cybersecurity preparedness.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Security Studies",
                "description": "<p>This course continues the exploration of the rapidly changing and highly complex geopolitical, technological and strategic context within which modern conflict and war occur, including the profound social, political, economic and cultural implications of the changing nature of war and conflict. It provides an overview of several fundamental themes that run through the history of war and strategy, and discusses the increasing importance of nonmilitary 'soft power' in managing conflict situations. The course also introduces the importance of regional knowledge in conflict as a critical operational competence (using the Russian invasion of Crimea and Ukraine as a case study), as well as the broader challenges of civilizational conflict and the importance of identity and narrative in modern conflict.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Future of War",
                "description": "<p>This course provides an overview of key issues, themes and ideas associated with the future of war. It contextualizes this discussion with a reflection on the impact of 9/11, especially within the U.S. The course engages a number of core concepts, including the meaning, nature and experience of war including theories that violence is in decline. It also considers the changing impact of new wars on civilians, shifts in current and future technology and future scenarios including questions of climate change, global demographics and potential major power conflicts. This course links the ideas, theories and understandings of the future of war with specific cases and concrete examples.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Understanding Conflict and War",
                "description": "<p>This course provides a critical overview of different definitions and meanings of war and armed conflict. It engages key theories used to understand conflict including realism, neorealism, liberalism and constructivism. The course considers core issues in the field, linking empirical studies with explanations for what drives, sustains and resolves conflict including reviewing the fact that democratic states tend not to go to war with each other (the democratic peace); the structure and logic of arms races; escalation and alliance; and core ideas regarding peace, conflict management and conflict resolution. Many of the issues and theories reviewed in this class are linked with case studies and concrete examples.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Law of War",
                "description": "<p>This course provides an overview of key elements of the law of war, also known as international humanitarian law (IHL) and the law of armed conflict (LOAC). It engages basic questions of international law, reviewing its history, sources and structure. The course covers jus ad Bellum, the rules governing how states legally go to war as well as jus in bello, the established ideas regarding how to manage actions during armed conflict. It also covers key principles within the law of war, including distinction, proportionality and necessity as well as reviewing the differences between international and noninternational armed conflicts and other key ideas. You’ll review the systems through which the law of war is enforced and also considers basic theoretical and practical issues regarding compliance. In general, links the ideas, practices, rules and understandings of the law of war with specific cases and concrete examples.</p>\n"
            },
            {
                "category": "Elective",
                "title": "U.S. Politics of Security",
                "description": "<p>This course builds a foundational understanding of the complex system of formal and informal actors and structural forces that shape U.S. security policy. It starts with both theoretical and case study examinations of the role domestic politics plays in the production of policy decisions. It analyzes critical institutional actors and relationships between actors, including: the President and Congress, the National Security Council and interagency, and the civilian-military relationship. Finally, it investigates key structural forces placed on the policy-making process by the American society, and the relationship between policymakers and the public.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Global Politics of Security",
                "description": "<p>This course offers several approaches to understanding the global politics of security, including: the structure of international and multinational security institutions and actors including nongovernmental organizations (NGOs), the United Nations' Security Council, peacekeeping missions, regional organizations (NATO, EU, Inter-American System, ASEAN) and others. It also considers the roles of private military and intelligence contractors and corporations working on issues of direct and indirect relation to security issues. Through specific case studies and examples, you’ll review the operation of these bodies and their complex relationships.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Comparative Studies of Conflict",
                "description": "<p>This course provides a critical overview of key theories on the causes, justifications and structures of political conflict and the use of violence. The course begins by outlining core issues within the problem of social order, that is, how to think about managing governance and power. It reviews the idea of 'collective action' and its link with force and violence, ideas that are contrasted with nonviolence as a political strategy. Then it considers civil wars and interstate wars, comparing these forms of organized violence, as well as the current challenges of armed nonstate actors (within an international system premised on states) and an overview of the meaning of peace. The course links the issues and theories reviewed in this class with case studies and concrete examples as a means of linking key ideas with their practical and policy implications.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Emerging Technologies and Global Security",
                "description": "<p>This course provides an introduction to the implications of accelerating changes in military and security technologies, fueled by rapid developments in five core technology systems: nanotechnology, biotechnology, information and communications technology (ICT), robotics and applied cognitive science. The course also introduces the idea of revolutions in military affairs, a concept that has been used to frame discussions about the strategic implications of new technologies from drones to cyber.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Governance in Post-Conflict/Transitional Contexts",
                "description": "<p>One of the most pressing current global security policy issues involves understanding and implementing strategies, mechanisms and processes to address post-conflict and transitional contexts. How do societies create and manage representational governance after the fall of authoritarian regimes? How can institutions be rebuilt and reconstituted? How can a social order address the justice demands of victims of brutal political violence whose suffering was often a key element of prior systems of rule? This course provides a critical introduction to the field of post-conflict reconstruction and transitional justice. It reviews the tense and uncertain nature of post-conflict environments and their challenges, engages the security questions raised by peacekeeping and stability operations. The course also considers the difficulties of governance and reconstruction in the aftermath of conflict.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Terrorism and Insurgency",
                "description": "<p>This course provides a critical overview of the use of terror by governments, insurgents and other nonstate actors. It engages the definition of terrorism and provides an overview of key practices and strategies. You’ll review key theories as to the causes, meaning and impact of the deployment of terror as a strategy by distinct groups. This involves a consideration of state terror, insurgencies and global terror networks. You’ll also link many of the core ideas reviewed in this class with a set of case studies designed to ground the broader discussion of terror within specific situations and contexts.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Global Trends",
                "description": "<p>This course provides an overview of a number of key issues within global politics in the post-Second World War era. It reviews important institutions, including the United Nations, the World Bank and the International Monetary Fund. The course provides a critical review of key theories, discourses and practices of international development, decolonization, democratization, poverty and gender issues. You’ll review these major aspects of global society in relationship to core questions of governance and social order with a consideration of past, present and future trends.</p>\n"
            }
        ]
    }
}