{
    "id": 2022,
    "code": "GRLA-LAPPSMA",
    "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/20190313PolicyDesignStudio_032.JPG",
    "title": "Political Psychology (MA)",
    "weeksPerClass": "7.5",
    "nextStartDate": "2024-01-08",
    "totalCreditHours": "30",
    "totalClasses": "10",
    "shortDescription": "<p>The Master of Arts in political psychology explores the cognitive forces that influence political decision-making. In this program, you’ll examine voter behavior and learn how to apply this knowledge to political campaigns and communications.</p>\n",
    "category": "Graduate",
    "interestareas": [
        "Law, criminal justice and public service",
        "Leadership and management"
    ],
    "featuredCourses": {
        "title": "Psychology and politics courses",
        "description": "<p>In this political psychology master’s program, you’ll take courses that’ll help you understand the minds of voters and citizens. You’ll explore the forces that impact voters’ political decision-making and learn many of the skills you need to understand and influence these decisions.</p>\n",
        "items": [
            {
                "category": "Core",
                "title": "Attitudes and Persuasion",
                "description": "<p>In this course, you’ll focus on the factors responsible for changes in beliefs, attitudes and behaviors. First covered in the course are the concept of attitudes and their measurement. Then, various theoretical approaches that explain how people come to change their attitudes. The course ends with an application-focused look at persuasion. Coursework also covers how to craft persuasive political messaging.</p>\n"
            },
            {
                "category": "Core",
                "title": "Biopolitics",
                "description": "<p>In this course, you’ll build a foundational understanding of biological, evolutionary, genetic and neurobiological perspectives in political psychology. These perspectives are combined to explain political attitudes and behavior. You will read related literature on developmental psychology, neurobiology, genetics and more.</p>\n"
            },
            {
                "category": "Core",
                "title": "Cognition and Emotions in Political Thinking",
                "description": "<p>In this course, you’ll focus on key concepts in cognitive psychology and the scientific study of mental processes. Topics include perception, attention, language, memory, reasoning, problem-solving, decision-making and attributions. The relation between emotions and cognition are also covered.</p>\n"
            },
            {
                "category": "Core",
                "title": "Experimental Design",
                "description": "<p>In this course, you’ll study the experimental paradigm that permeates political psychology research. You will master the logic of experimentation and learn how to design and evaluate experimental studies. The course is focused on the benefits and drawbacks of a variety of different experimental designs.</p>\n"
            },
            {
                "category": "Core",
                "title": "Fundamentals of Political Psychology",
                "description": "<p>In this course, you’ll learn the tools necessary to apply political psychology theories to marketing, political campaigns and policy advocacy. The course examines topics including personality, emotions and genetic bases of behavior. It also covers approaches to the design and interpretation of experimental research.</p>\n"
            },
            {
                "category": "Core",
                "title": "Prejudice, Stereotypes and Intergroup Relations",
                "description": "<p>In this course, you’ll explore why stereotypes and prejudice exist and their implications for politics. Students in the course are also introduced to Social Identity Theory and its application to politics. You will learn the theoretical arguments for and concrete examples of how prejudice can be reduced and tolerance increased.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Advances in Media Effects",
                "description": "<p>This course provides an advanced examination of contemporary research and debates on media effects. You will examine the underlying psychological mechanisms through which the media can affect citizens’ attitudes and judgments. In the course, a variety of examples are used to demonstrate both the power and limits of the media.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Campaigns and Elections",
                "description": "<p>This course covers the effect of election rules, campaigns, social networks and the media on turnout and voter choices. Students engage with research that addresses these topics through psychological lenses focusing on the role of emotions, negativity, persuasion and learning. Implications for campaign organization and management are also discussed.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Elite Decision Making",
                "description": "<p>In this course, you’ll learn about political psychology approaches to understanding and evaluating elite decision-making. The course is focused on frameworks that will help you systematically study how elite actors make decisions on the domestic and international stage.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Political Polarization",
                "description": "<p>This course includes an overview of recent trends in political polarization in the U.S. Debates such as whether polarization has increased over time and whether Americans are polarized around issues or social identities are also covered. In the course, you will also explore how the media and other external factors can affect citizens in ways that can either fuel or weaken the intensity of polarization.</p>\n"
            },
            {
                "category": "Elective",
                "title": "Public Opinion",
                "description": "<p>In this course, you’ll learn about how citizens structure their opinions and what factors can cause these opinions to change. In the course, various theoretical perspectives and methodological approaches used to study public opinion are also evaluated. The course also provides insight into how these factors shape people’s evaluation of government and how individual-level opinions are aggregated to produce public opinion.</p>\n"
            },
            {
                "category": "Culminating experience",
                "title": "Capstone",
                "description": "<p>This course serves as the required culminating experience of the degree. You will apply the theories, frameworks and evidence encountered during the course to explore a novel question or contribute to a contemporary research debate. In the process, you will apply a multitude of tools you acquired during the program.</p>\n"
            }
        ]
    }
}