{
  "id": 2233,
  "code": "GRLA-LAIALMA",
  "degreeImage": "https://live-asuocms.ws.asu.edu/sites/default/files/program-images/International%20Affairs%20Hero%201.jpg",
  "title": "International Affairs and Leadership (MA)",
  "weeksPerClass": "7.5",
  "nextStartDate": "2024-01-08",
  "totalCreditHours": "30",
  "totalClasses": "10",
  "shortDescription": "<p>The online master’s in international affairs and leadership is ideal for individuals who are passionate about global issues and who want to make a positive impact on the world. You’ll prepare to become a leader in the international affairs realm.</p>\n",
  "category": "Graduate",
  "interestareas": [
    "Behavioral sciences",
    "Law, criminal justice and public service",
    "Social Sciences"
  ],
  "featuredCourses": {
    "title": "International affairs and leadership courses",
    "description": "<p>This program is not cohort-based, which means you can choose to take one or more courses as your schedule permits. You’ll complete unique courses to develop your vision and skills as a character-driven leader in your career and community. Courses focus on international themes for the future and regional issues in key global areas. Electives are taught by former ambassadors and policy managers with deep practical experience in both strategic diplomacy and grass roots engagement in a variety of cultures.</p>\n",
    "items": [
      {
        "category": "Required",
        "title": "Principles of Character-Driven Leadership",
        "description": "<p>This course covers the core concepts of character-driven leadership defined as the commitment to do the right thing, the right way for the right reasons. The course focuses on values – individual, organizational and national – along with ethics, culminating with a clear understanding of leadership.</p>\n"
      },
      {
        "category": "Required",
        "title": "The Making of U.S. National Security Policy",
        "description": "<p>This course outlines the origins and current structure of America’s national security architecture. Using actual policy decisions, students will exercise the process of analysis, decision-making and translating into action elements of the country’s national security agenda. The course will also include intensive analysis of the intent and outcome of such critical policy decisions and the leadership exercised by the participating decision-makers.</p>\n"
      },
      {
        "category": "Required",
        "title": "Applied International Leadership: Case Studies",
        "description": "<p>In this course, students will engage with faculty and with each other in multiple in-depth applied leadership scenarios, examining various aspects of leadership in international settings. The semester will culminate in individual student presentations analyzing a complex international leadership challenge.</p>\n"
      },
      {
        "category": "Required",
        "title": "Capstone",
        "description": "<p>Each student must prepare a comprehensive presentation capturing the knowledge and insights gained during the degree program, focused on a specific international affairs leadership challenge. A 45-minute oral and written presentation must show analytical rigor and defend a tangible strategic plan for achieving impact and positive change.</p>\n"
      },
      {
        "category": "Elective ",
        "title": "U.S. Diplomacy in Action – the Embassy Country Team",
        "description": "<p>Led by a former U.S. Ambassador, students constitute an U.S. Embassy Country Team for a specific country and manage a reality-based diplomatic agenda. Students will be assigned the actual roles of Embassy team members, and together with their “Ambassador” will practice how U.S. foreign policy is developed and executed in the field.</p>\n"
      },
      {
        "category": "Elective",
        "title": "The Modern Global Economy: Dollars and Sense",
        "description": "<p>Students will be challenged to consider future economic and business trends and technology that offer growth and opportunities, but also economic and business developments that threaten stability such as cyber threats and pandemics. Traditional trading and finance global systems will be compared to the rising new economic “nationalism\". Regional economic alliances will be evaluated.</p>\n"
      },
      {
        "category": "Elective",
        "title": "Transatlantic Relations: Does Europe Still Matter?",
        "description": "<p>This course projects forward the directions the U.S. and Europe are moving. The students will be challenged to analyze and consider “over the horizon” trends and opportunities, but also the risks of conflict and how to mitigate and solve challenges. Case studies will present “Character-driven leadership” by U.S. and European leaders as they manage issues of cooperation and competition.</p>\n"
      },
      {
        "category": "Elective",
        "title": "Western Hemisphere: Good Neighbors, Tough Challenges",
        "description": "<p>This course will explore the opportunities and challenges facing the United States in its relationships with its regional neighbors, including Canada, Mexico, Central America, the Caribbean and South America. The lectures and readings will consider how the region’s social, cultural and economic history shapes its relations with the U.S. and the rest of the world.</p>\n"
      },
      {
        "category": "Elective",
        "title": "Human Rights and Realpolitik",
        "description": "<p>This course will explore the origins of the human rights movement, watershed moments and contemplate what may be next. The course is based on the foundation that respecting human rights is not simply the right moral choice, but one that has economic and national security implications: that the world is more prosperous and more secure when freedom and rights are universally afforded.</p>\n"
      },
      {
        "category": "Elective",
        "title": "Setting a Global Counterterrorism Agenda",
        "description": "<p>Students analyze, discuss and propose tactics and strategies for countering global terrorism, mainly, but not exclusively from the U.S. perspective. This course focuses on U.S. counter-terrorism strategy against Middle East terrorism since 9/11. Based on actual policy decisions, students will exercise the process of decision-making and translating into action, elements of the U.S. counter-terrorism agenda in partnership with allies and adversaries.</p>\n"
      },
      {
        "category": "Elective",
        "title": "Transnational Challenges – Combatting Human Trafficking",
        "description": "<p>This course gives a practical, global, interdisciplinary examination of the many issues surrounding human trafficking and modern slavery. Students will connect similarities and differences between historical and modern-day slavery, analyze the role and impact of criminal and civil justice sector decisions and actions in fighting human trafficking and understand the role of international and national laws and other government rulemaking.</p>\n"
      },
      {
        "category": null,
        "title": "Special Topic Courses",
        "description": "<p>These are new courses that are developed by ASU Professors of Practice and other ASU faculty who serve the educational outcomes of the program but have not yet been turned into permanent courses.</p>\n"
      },
      {
        "category": null,
        "title": "Elective Internship",
        "description": "<p>As an addendum to the 30 credit hour MA program , students can voluntarily identify and participate in a semester-long field project in the public or private sector in an international setting, either abroad or with a U.S.-based international organization. As part of the internship, the student must integrate into the assigned organization’s professional team and participate in its mission achievement. International affairs and leadership faculty and staff will be available to advise on internship opportunities.</p>\n"
      }
    ]
  }
}